---
type: IGetLocalPathForOpenCallback
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IGetLocalPathForOpenCallback

`Autodesk.Revit.DB.IGetLocalPathForOpenCallback` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetLocalPathForOpen | 2015 | `string GetLocalPathForOpen ( ExternalResourceReference desiredResource )` |